{
  "metadata": {
    "date_generation": "2025-07-11T11:16:43.242157",
    "nombre_scripts": 9,
    "types_activites": [
      "quiz",
      "text",
      "accordion"
    ]
  },
  "scripts": {
    "01-Intro-01_text": {
      "activite": {
        "sequence": "Introduction à l'Histoire du Maroc au 19ème siècle",
        "num_ecran": "01-Intro-01",
        "titre_ecran": "Contexte historique",
        "sous_titre": "Plongée dans l'histoire marocaine",
        "resume_contenu": "Cette séquence présente les enjeux historiques du Maroc au 19ème siècle, les dynasties en place et les influences externes qui ont façonné le pays.",
        "type_activite": "text",
        "niveau_bloom": "Comprendre",
        "difficulte": "facile",
        "duree_estimee": 10,
        "objectif_lie": "L'apprenant sera capable de décrire les événements clés de l'histoire du Maroc au 19ème siècle.",
        "commentaire": "Cette activité vise à contextuellement introduire les événements marquants et les dynasties du Maroc, facilitant ainsi la compréhension."
      },
      "script": "**Titre accrocheur :** Une Exploration du Maroc au 19ème Siècle\n\n**Introduction captivante :**  \nBienvenue dans notre voyage à travers le temps, où nous explorerons le Maroc du 19ème siècle. Une époque de transformations profondes, marquée par des dynasties influentes et des événements historiques significatifs. Préparez-vous à découvrir comment ces éléments ont façonné le Maroc d'aujourd'hui.\n\n**Contenu principal :**  \n\n**1. Les Dynasties en Place :**  \nAu 19ème siècle, le Maroc est gouverné par la dynastie Alaouite. **Fondée au 17ème siècle**, cette dynastie a joué un rôle crucial dans la consolidation du pouvoir central. *Les Alaouites ont réussi à préserver l'unité du pays malgré les pressions internes et externes*.\n\n- **Exemple concret :** Moulay Slimane, qui a régné de 1792 à 1822, a été un sultan notable de cette dynastie. Il est connu pour avoir renforcé l'autorité du sultanat et modernisé l'administration.\n\n**2. Influences Externes :**  \nLe 19ème siècle est aussi une période d'influences étrangères croissantes, notamment de la part des puissances européennes comme la France et l'Espagne. Ces pays cherchaient à étendre leur influence économique et politique au Maroc.\n\n- **Exemple concret :** En 1844, la *bataille de l'Isly* marque un tournant où les forces marocaines sont vaincues par l'armée française, symbolisant l'ingérence croissante de la France dans les affaires marocaines.\n\n**3. Enjeux Historiques :**  \nLes enjeux principaux de cette époque incluent la modernisation du pays et la préservation de son indépendance face aux ambitions coloniales. Les sultans de l'époque ont dû naviguer entre tradition et modernité pour maintenir l'intégrité du royaume.\n\n- **Exemple concret :** Le sultan Moulay Hassan Ier (1873-1894) a initié plusieurs réformes pour moderniser l'armée et l'administration, tout en cherchant à limiter l'influence étrangère.\n\n**Conclusion avec points clés à retenir :**  \nLe 19ème siècle a été une période charnière pour le Maroc, caractérisée par la gouvernance de la dynastie Alaouite, une pression étrangère croissante, et des efforts de modernisation. Comprendre ces dynamiques est essentiel pour saisir les fondements de l'histoire marocaine contemporaine.\n\n**Transition vers la suite :**  \nMaintenant que vous avez un aperçu des dynasties et des enjeux historiques du Maroc au 19ème siècle, nous allons approfondir notre exploration en examinant les réformes sociales et économiques de cette époque. Préparez-vous à découvrir comment ces transformations ont influencé la société marocaine."
    },
    "02-Seq-01_text": {
      "activite": {
        "sequence": "Événements clés du 19ème siècle",
        "num_ecran": "02-Seq-01",
        "titre_ecran": "Les événements marquants",
        "sous_titre": "Description des événements",
        "resume_contenu": "L'apprenant étudiera cinq événements clés de l'histoire du Maroc, en fournissant des détails sur leur contexte et leur importance.",
        "type_activite": "text",
        "niveau_bloom": "Comprendre",
        "difficulte": "facile",
        "duree_estimee": 12,
        "objectif_lie": "L'apprenant sera capable de décrire les événements clés de l'histoire du Maroc au 19ème siècle.",
        "commentaire": "Utiliser une approche narrative pour faciliter la mémorisation des événements historiques."
      },
      "script": "**Titre Accrocheur :** Voyage à travers le 19ème siècle du Maroc\n\n**Introduction Captivante :**\n\nBienvenue dans un voyage fascinant à travers l'histoire du Maroc au 19ème siècle. Ce fut une période riche en événements marquants qui ont façonné le pays tel que nous le connaissons aujourd'hui. Ensemble, explorons cinq de ces événements clés pour comprendre leur contexte et leur importance.\n\n**Contenu Principal :**\n\n**1. La Bataille d'Isly (1844)**\n\n*Contexte :*  \nEn 1844, la tension entre la France et le Maroc atteint son paroxysme. La France, ayant déjà conquis l'Algérie, se heurte à la résistance marocaine. \n\n*Importance :*  \nLa défaite marocaine à Isly montre la supériorité militaire française et pousse le Maroc à signer le traité de Tanger. **Ce traité marque le début de l'influence croissante de la France dans la région.**\n\n*Exemple concret :*  \nImaginez un champ de bataille où deux cultures se rencontrent, l'une défendant farouchement son territoire tandis que l'autre impose sa domination.\n\n**2. Révolution de Taza (1871)**\n\n*Contexte :*  \nAprès la montée des tensions sociales et politiques, le peuple de Taza s'est soulevé contre le makhzen (autorité centrale).\n\n*Importance :*  \nCette révolte met en lumière les désaccords internes et la nécessité de réformes pour maintenir l'unité nationale.\n\n*Exemple concret :*  \nVisualisez une ville en effervescence, où les cris des révoltés résonnent dans les rues, réclamant justice et changement.\n\n**3. La Convention de Madrid (1880)**\n\n*Contexte :*  \nAvec plusieurs puissances européennes lorgnant sur le Maroc, une réunion internationale est organisée pour régler les intérêts économiques.\n\n*Importance :*  \nLa convention établit des règles concernant les emprunts et les droits commerciaux, **préfigurant une période de modernisation économique.**\n\n*Exemple concret :*  \nPensez à une table où se rassemblent des représentants de différents pays, chacun cherchant à tirer profit de cette terre prometteuse.\n\n**4. Rébellion de Bou Hmara (1902-1909)**\n\n*Contexte :*  \nBien que débutant à la fin du 19ème siècle, cette rébellion est une réaction à la faiblesse du sultanat et aux influences étrangères.\n\n*Importance :*  \nElle démontre les fractures internes et la montée des leaders charismatiques cherchant à renverser le pouvoir établi.\n\n*Exemple concret :*  \nImaginez un chef charismatique galvanisant les foules avec des promesses de changement et de libération.\n\n**5. La réorganisation administrative de 1854**\n\n*Contexte :*  \nEn réponse aux pressions internes et externes, le Maroc entreprend une réorganisation de son administration.\n\n*Importance :*  \nCette réorganisation vise à renforcer l'autorité centrale et à améliorer l'efficacité gouvernementale.\n\n*Exemple concret :*  \nVisualisez des fonctionnaires redessinant la carte administrative du pays pour optimiser la gestion des ressources et du pouvoir.\n\n**Conclusion : Points Clés à Retenir**\n\n- **Bataille d'Isly :** Début de l'influence française.  \n- **Révolution de Taza :** Besoin pressant de réformes.  \n- **Convention de Madrid :** Modernisation économique.  \n- **Rébellion de Bou Hmara :** Fractures internes et leadership alternatif.  \n- **Réorganisation de 1854 :** Renforcement de l'autorité centrale.  \n\n**Transition vers la Suite :**\n\nVous avez désormais une vue d'ensemble des événements qui ont marqué le 19ème siècle marocain. Prêt à découvrir comment ces événements ont façonné le Maroc moderne ? Continuons notre exploration dans les chapitres suivants."
    },
    "02-Seq-02_quiz": {
      "activite": {
        "sequence": "Quiz sur les événements clés",
        "num_ecran": "02-Seq-02",
        "titre_ecran": "Évaluation des connaissances",
        "sous_titre": "Questions sur les événements clés",
        "resume_contenu": "Un quiz interactif permettra aux apprenants de vérifier leur compréhension des événements clés et de leur importance.",
        "type_activite": "quiz",
        "niveau_bloom": "Comprendre",
        "difficulte": "moyen",
        "duree_estimee": 10,
        "objectif_lie": "L'apprenant sera capable de décrire les événements clés de l'histoire du Maroc au 19ème siècle.",
        "commentaire": "Ce quiz facilitera l'auto-évaluation et renforcera la compréhension."
      },
      "script": "```json\n[\n  {\n    \"question\": \"Quel événement a marqué le début de la modernisation du Maroc au 19ème siècle ?\",\n    \"options\": {\n      \"A\": \"La bataille de Tétouan\",\n      \"B\": \"La signature du traité de Fès\",\n      \"C\": \"L'arrivée des premières missions diplomatiques européennes\",\n      \"D\": \"La construction du port de Casablanca\"\n    },\n    \"correct\": \"C\"\n  },\n  {\n    \"question\": \"Vrai ou Faux : La guerre du Rif a eu lieu au 19ème siècle.\",\n    \"options\": {\n      \"A\": \"Vrai\",\n      \"B\": \"Faux\"\n    },\n    \"correct\": \"B\"\n  },\n  {\n    \"question\": \"Quel traité a été signé en 1860 entre le Maroc et l'Espagne ?\",\n    \"options\": {\n      \"A\": \"Traité de Madrid\",\n      \"B\": \"Traité de Marrakech\",\n      \"C\": \"Traité de Tétouan\",\n      \"D\": \"Traité de Fès\"\n    },\n    \"correct\": \"C\"\n  },\n  {\n    \"question\": \"Quel était l'objectif principal des réformes administratives entreprises par le Sultan Moulay Hassan 1er ?\",\n    \"options\": {\n      \"A\": \"Renforcer le pouvoir central\",\n      \"B\": \"Améliorer les relations commerciales avec l'Europe\",\n      \"C\": \"Moderniser l'armée\",\n      \"D\": \"Augmenter les impôts\"\n    },\n    \"correct\": \"A\"\n  },\n  {\n    \"question\": \"Vrai ou Faux : Le Maroc a aboli l'esclavage au 19ème siècle.\",\n    \"options\": {\n      \"A\": \"Vrai\",\n      \"B\": \"Faux\"\n    },\n    \"correct\": \"A\"\n  }\n]\n```"
    },
    "07-Seq-01_quiz": {
      "activite": {
        "sequence": "Évaluation de l'influence étrangère",
        "num_ecran": "07-Seq-01",
        "titre_ecran": "Influence des puissances étrangères",
        "sous_titre": "Évaluation des impacts",
        "resume_contenu": "L'apprenant évaluera l'influence de deux puissances étrangères sur le Maroc, en discutant des conséquences sur la politique marocaine.",
        "type_activite": "quiz",
        "niveau_bloom": "Évaluer",
        "difficulte": "difficile",
        "duree_estimee": 20,
        "objectif_lie": "L'apprenant sera capable d'évaluer l'influence des puissances étrangères sur le Maroc au 19ème siècle.",
        "commentaire": "Ce quiz doit inclure des scénarios basés sur les connaissances acquises pour affiner l'évaluation."
      },
      "script": "```json\n[\n  {\n    \"question\": \"Quel a été l'impact principal de l'influence française sur la politique marocaine au 19ème siècle ?\",\n    \"options\": {\n      \"A\": \"Renforcement de l'indépendance économique\",\n      \"B\": \"Renforcement de l'indépendance politique\",\n      \"C\": \"Imposition de réformes administratives\",\n      \"D\": \"Expansion territoriale du Maroc\"\n    },\n    \"correct\": \"C\"\n  },\n  {\n    \"question\": \"Vrai ou faux : L'influence britannique au Maroc a principalement visé à établir des bases militaires.\",\n    \"options\": {\n      \"A\": \"Vrai\",\n      \"B\": \"Faux\"\n    },\n    \"correct\": \"B\"\n  },\n  {\n    \"question\": \"La politique marocaine au 19ème siècle a été influencée par la rivalité entre quelles deux puissances ?\",\n    \"options\": {\n      \"A\": \"France et Espagne\",\n      \"B\": \"France et Angleterre\",\n      \"C\": \"Espagne et Portugal\",\n      \"D\": \"Angleterre et Allemagne\"\n    },\n    \"correct\": \"B\"\n  },\n  {\n    \"question\": \"En évaluant les conséquences des influences étrangères, laquelle de ces politiques marocaines a été directement affectée ?\",\n    \"options\": {\n      \"A\": \"Politique éducative\",\n      \"B\": \"Politique agricole\",\n      \"C\": \"Politique militaire\",\n      \"D\": \"Politique de santé\"\n    },\n    \"correct\": \"C\"\n  },\n  {\n    \"question\": \"Quel était l'objectif principal des puissances étrangères en influençant la politique marocaine au 19ème siècle ?\",\n    \"options\": {\n      \"A\": \"Établir des alliances économiques\",\n      \"B\": \"Exploiter les ressources naturelles\",\n      \"C\": \"Éliminer l'influence d'autres puissances\",\n      \"D\": \"Moderniser le système politique marocain\"\n    },\n    \"correct\": \"C\"\n  }\n]\n```"
    },
    "08-Synth-01_quiz": {
      "activite": {
        "sequence": "Synthèse et évaluation finale",
        "num_ecran": "08-Synth-01",
        "titre_ecran": "Évaluation des acquis",
        "sous_titre": "Bilan des connaissances",
        "resume_contenu": "L'apprenant participera à une évaluation finale récapitulant les connaissances acquises sur l'histoire du Maroc au 19ème siècle.",
        "type_activite": "quiz",
        "niveau_bloom": "Évaluer",
        "difficulte": "difficile",
        "duree_estimee": 30,
        "objectif_lie": "Évaluation récapitulative des connaissances sur le Maroc au 19ème siècle.",
        "commentaire": "Prévoir une variété de questions pour tester tous les aspects couverts durant la formation."
      },
      "script": "```json\n[\n  {\n    \"question\": \"Quelle était la principale raison de l'intérêt européen pour le Maroc au 19ème siècle ?\",\n    \"options\": {\n      \"A\": \"Sa position stratégique pour le commerce maritime\",\n      \"B\": \"Ses ressources en pétrole\",\n      \"C\": \"Son potentiel agricole\",\n      \"D\": \"La richesse de ses mines d'or\"\n    },\n    \"correct\": \"A\"\n  },\n  {\n    \"question\": \"Vrai ou Faux : Le traité de la Conférence de Madrid en 1880 a renforcé l'indépendance du Maroc.\",\n    \"options\": {\n      \"A\": \"Vrai\",\n      \"B\": \"Faux\"\n    },\n    \"correct\": \"B\"\n  },\n  {\n    \"question\": \"Comparez les politiques coloniales de la France et de l'Espagne au Maroc au 19ème siècle. Quelle affirmation est correcte ?\",\n    \"options\": {\n      \"A\": \"La France a concentré ses efforts sur le développement industriel, tandis que l'Espagne s'est focalisée sur l'agriculture.\",\n      \"B\": \"Les deux pays ont collaboré pour développer les infrastructures du Maroc.\",\n      \"C\": \"La France a utilisé une approche plus directe et interventionniste que l'Espagne.\",\n      \"D\": \"L'Espagne a établi un protectorat bien avant la France.\"\n    },\n    \"correct\": \"C\"\n  },\n  {\n    \"question\": \"Critiquez l'impact social des réformes militaires mises en place par le Sultan Moulay Hassan au 19ème siècle.\",\n    \"options\": {\n      \"A\": \"Elles ont modernisé l'armée sans affecter la structure sociale traditionnelle.\",\n      \"B\": \"Elles ont causé un mécontentement parmi les tribus locales en imposant de nouvelles taxes.\",\n      \"C\": \"Elles ont renforcé les relations avec les puissances européennes grâce à des alliances.\",\n      \"D\": \"Elles ont amélioré l'économie sans perturber la société marocaine.\"\n    },\n    \"correct\": \"B\"\n  },\n  {\n    \"question\": \"Évaluez l'efficacité des réformes économiques au Maroc au 19ème siècle. Quelle affirmation est la plus appropriée ?\",\n    \"options\": {\n      \"A\": \"Les réformes ont permis une croissance économique rapide et soutenue.\",\n      \"B\": \"Elles ont échoué en raison de la résistance des chefs tribaux.\",\n      \"C\": \"Les réformes ont partiellement réussi, mais ont été limitées par les intérêts européens.\",\n      \"D\": \"Elles ont transformé le Maroc en une puissance industrielle régionale.\"\n    },\n    \"correct\": \"C\"\n  },\n  {\n    \"question\": \"Quelle était la conséquence principale de la défaite du Maroc à la bataille d'Isly en 1844 ?\",\n    \"options\": {\n      \"A\": \"La reconnaissance de l'indépendance algérienne\",\n      \"B\": \"Le renforcement des liens avec l'Empire Ottoman\",\n      \"C\": \"La signature d'un traité de paix avec la France\",\n      \"D\": \"La perte de territoires marocains au profit de l'Espagne\"\n    },\n    \"correct\": \"C\"\n  }\n]\n```"
    },
    "03-Seq-01_text": {
      "activite": {
        "sequence": "Relations internationales du Maroc",
        "num_ecran": "03-Seq-01",
        "titre_ecran": "Relations internationales",
        "sous_titre": "Expliquer les enjeux",
        "resume_contenu": "L'apprenant identifiera les principales relations internationales du Maroc au 19ème siècle, en se concentrant sur trois pays et les enjeux associés.",
        "type_activite": "text",
        "niveau_bloom": "Comprendre",
        "difficulte": "moyen",
        "duree_estimee": 15,
        "objectif_lie": "L'apprenant sera capable d'expliquer les relations internationales du Maroc au 19ème siècle.",
        "commentaire": "Cette activité doit lier les relations internationales aux événements marquants pour favoriser la compréhension."
      },
      "script": "**Titre accrocheur :** Les Relations Internationales du Maroc au 19ème Siècle : Enjeux et Influences\n\n**Introduction captivante :**\n\nLes relations internationales sont le reflet des dynamiques géopolitiques d'une époque donnée. Au 19ème siècle, le Maroc, à la croisée des chemins entre l'Europe et l'Afrique, était un acteur clé dans le jeu complexe des alliances et des rivalités. Dans cette activité, nous explorerons comment le Maroc a navigué à travers ses relations avec trois pays influents de l'époque et les enjeux qui en ont découlé.\n\n**Contenu principal :**\n\n**Section 1 : Le Maroc et la France**\n\n- *Le Contexte Historique* : Au début du 19ème siècle, la France cherchait à étendre son influence en Afrique du Nord. La proximité géographique et les ambitions coloniales ont mené à des interactions intenses entre les deux pays.\n  \n- *Les Enjeux* :\n  - **Économiques** : La France voyait le Maroc comme un partenaire commercial potentiel et une source de matières premières.\n  - **Politiques** : La France désirait établir un protectorat pour sécuriser ses intérêts.\n  \n- *Exemple Concret* : Le traité de Lalla Maghnia en 1845, qui délimitait les frontières entre l'Algérie française et le Maroc, illustrant les pressions françaises sur le Maroc.\n\n**Section 2 : Le Maroc et le Royaume-Uni**\n\n- *Le Contexte Historique* : Le Royaume-Uni, puissance maritime dominante, visait à contrecarrer l'influence française et à protéger ses routes commerciales vers l'Inde.\n  \n- *Les Enjeux* :\n  - **Stratégiques** : Maintenir l'accès aux routes maritimes méditerranéennes.\n  - **Diplomatiques** : Établir des alliances pour équilibrer l'influence française.\n  \n- *Exemple Concret* : Les accords de Tanger en 1856, qui renforçaient les relations commerciales et diplomatiques entre le Maroc et le Royaume-Uni.\n\n**Section 3 : Le Maroc et l'Espagne**\n\n- *Le Contexte Historique* : L'Espagne, cherchant à récupérer son influence dans la région, considérait le Maroc comme un territoire d'expansion possible après la perte de ses colonies américaines.\n  \n- *Les Enjeux* :\n  - **Territoriaux** : Conflits pour le contrôle de certaines régions marocaines.\n  - **Militaires** : La guerre hispano-marocaine de 1859-1860, résultant en une victoire espagnole.\n  \n- *Exemple Concret* : La cession de la ville de Tetouan à l'Espagne pendant une courte période après la guerre.\n\n**Conclusion : Points clés à retenir**\n\n- Les relations internationales du Maroc au 19ème siècle étaient marquées par des enjeux économiques, politiques et territoriaux.\n- Les interactions avec la France, le Royaume-Uni et l'Espagne ont façonné le paysage géopolitique de la région.\n- Comprendre ces relations aide à saisir l'importance des dynamiques historiques dans le développement des nations.\n\n**Transition vers la suite :**\n\nEn poursuivant votre exploration des relations internationales du Maroc, vous découvrirez comment ces interactions ont évolué au 20ème siècle, influençant la modernisation et la souveraineté du pays. Préparez-vous à plonger dans les réformes économiques et politiques qui ont suivi ces relations complexes."
    },
    "04-Seq-01_accordion": {
      "activite": {
        "sequence": "Analyse des impacts politiques et sociaux",
        "num_ecran": "04-Seq-01",
        "titre_ecran": "Impacts des changements",
        "sous_titre": "Analyse des changements",
        "resume_contenu": "L'apprenant analysera les impacts de trois changements politiques et sociaux majeurs sur le Maroc durant le 19ème siècle.",
        "type_activite": "accordion",
        "niveau_bloom": "Analyser",
        "difficulte": "moyen",
        "duree_estimee": 20,
        "objectif_lie": "L'apprenant sera capable d'analyser les impacts des changements politiques et sociaux sur le Maroc durant le 19ème siècle.",
        "commentaire": "Utiliser des sections dépliables pour structurer l'analyse des impacts."
      },
      "script": "**Script d'Accordion Pédagogique : Analyse des Impacts des Changements au Maroc au 19ème Siècle**\n\n---\n\n**1. Introduction Générale**\n\nBienvenue dans cette activité d'analyse des impacts des changements politiques et sociaux du 19ème siècle au Maroc. Au cours des 20 prochaines minutes, vous aurez l'occasion de découvrir et d'analyser trois événements majeurs qui ont façonné l'histoire du pays. Ces événements ont eu des répercussions profondes et variées qui méritent une étude approfondie. Préparez-vous à ouvrir chaque section pour explorer les détails de ces changements.\n\n---\n\n**2. Sections Dépliables**\n\n**Section 1 : Réforme du Makhzen (Cliquez pour développer)**\n\n- *Contenu détaillé :* \n  - **Définition et Contexte** : Le Makhzen désigne l'administration centrale du royaume marocain. À la fin du 19ème siècle, face aux pressions économiques et militaires externes, des réformes ont été entreprises pour moderniser l'administration et renforcer le pouvoir central.\n  - **Impacts** : \n    - **Politique** : Centralisation accrue du pouvoir et réduction des privilèges des élites locales.\n    - **Social** : Modifications des droits de taxation et tensions entre le pouvoir central et les tribus.\n  - **Éléments visuels suggérés** : Carte du Maroc avec indication des régions sous influence du Makhzen.\n  - **Interaction recommandée** : Survoler les éléments clés pour afficher des définitions supplémentaires.\n\n**Section 2 : Introduction de Nouvelles Cultures Agricoles (Cliquez pour développer)**\n\n- *Contenu détaillé :* \n  - **Contexte** : Au 19ème siècle, sous l'influence européenne, de nouvelles cultures comme le coton et la canne à sucre ont été introduites.\n  - **Impacts** : \n    - **Économique** : Diversification des cultures agricoles, mais dépendance accrue aux marchés européens.\n    - **Social** : Changements dans les structures de propriété foncière et déplacement des communautés rurales.\n  - **Éléments visuels suggérés** : Schéma comparatif des cultures traditionnelles et introduites.\n  - **Interaction recommandée** : Cliquer sur une culture pour voir son impact économique et social.\n\n**Section 3 : Ouverture Commerciale et Traités Inégaux (Cliquez pour développer)**\n\n- *Contenu détaillé :* \n  - **Contexte** : Le Maroc signe plusieurs traités commerciaux avec les puissances européennes qui ouvrent ses marchés.\n  - **Impacts** : \n    - **Économique** : Influx de produits européens, déséquilibre commercial, et endettement du pays.\n    - **Politique** : Perte de souveraineté économique et montée des tensions internes.\n  - **Éléments visuels suggérés** : Diagramme montrant les flux commerciaux avant et après les traités.\n  - **Interaction recommandée** : Clic sur les traités pour voir une analyse de leurs clauses principales.\n\n**Section 4 : Mouvements Sociaux et Réactions Populaires (Cliquez pour développer)**\n\n- *Contenu détaillé :* \n  - **Contexte** : Les changements et les réformes suscitent des mouvements de résistance et des révoltes populaires.\n  - **Impacts** : \n    - **Social** : Renforcement des identités locales et ethniques face aux réformes imposées.\n    - **Politique** : Confrontations entre le pouvoir central et les régions rebelles.\n  - **Éléments visuels suggérés** : Chronologie des principales révoltes et mouvements sociaux du siècle.\n  - **Interaction recommandée** : Survoler les révoltes pour des détails sur les leaders et les causes.\n\n---\n\n**3. Conclusion**\n\nÀ travers l'exploration de ces sections, vous avez analysé les divers impacts des changements politiques et sociaux sur le Maroc au 19ème siècle. Votre compréhension de ces événements vous permettra de mieux évaluer les dynamiques historiques du pays et de réfléchir aux leçons que l'on peut en tirer pour l'avenir.\n\n---\n\nCette activité vous a permis d'approfondir votre capacité à analyser des événements historiques complexes dans un cadre structuré et interactif."
    },
    "05-Seq-01_accordion": {
      "activite": {
        "sequence": "Personnages historiques marocains",
        "num_ecran": "05-Seq-01",
        "titre_ecran": "Contextualisation des personnages",
        "sous_titre": "Situer les personnages",
        "resume_contenu": "L'apprenant situera quatre personnages historiques marocains dans leur contexte, en décrivant leur rôle et leur influence.",
        "type_activite": "accordion",
        "niveau_bloom": "Comprendre",
        "difficulte": "difficile",
        "duree_estimee": 30,
        "objectif_lie": "L'apprenant sera capable de situer les principaux personnages historiques marocains du 19ème siècle dans leur contexte.",
        "commentaire": "Offrir une approche comparative pour faciliter la compréhension des rôles des personnages."
      },
      "script": "**Script d'Accordion : Contextualisation des personnages historiques marocains**\n\n**Introduction générale :**\n\nDans cette activité, nous allons explorer les vies et les contextes de quatre personnages historiques marocains influents du 19ème siècle. Vous apprendrez à comprendre leur rôle et leur influence dans l'histoire du Maroc. Cet exercice vous aidera à situer ces figures dans leur contexte socio-politique et à comparer leurs impacts respectifs.\n\n---\n\n**Section 1 : Le Sultan Moulay Abd al-Rahman (Fermé)**\n\n*Contenu détaillé (Ouvert) :*\n\nMoulay Abd al-Rahman, qui a régné de 1822 à 1859, a joué un rôle crucial dans la résistance contre les ingérences européennes. Sous son règne, le Maroc a connu des changements économiques et sociaux significatifs. Explorez comment il a renforcé l'administration centrale et a essayé de moderniser l'armée.\n\n- **Éléments visuels suggérés** : Carte du Maroc sous son règne, portrait du Sultan.\n- **Interactions recommandées** : Clic pour ouvrir une ligne de temps interactive montrant les événements majeurs de son règne.\n\n---\n\n**Section 2 : Ahmed Arabi al-Masri (Fermé)**\n\n*Contenu détaillé (Ouvert) :*\n\nBien qu'égyptien, Ahmed Arabi a eu une influence sur le Maroc en raison de ses idées réformatrices qui ont trouvé écho chez les intellectuels marocains. Comparez ses réformes avec celles entreprises par Moulay Abd al-Rahman. \n\n- **Éléments visuels suggérés** : Schéma comparatif des réformes marocaines et égyptiennes.\n- **Interactions recommandées** : Survol pour des définitions expandables des réformes.\n\n---\n\n**Section 3 : Kadi Mohammed Ben Abdellah (Fermé)**\n\n*Contenu détaillé (Ouvert) :*\n\nEn tant que chef religieux et juge, Kadi Mohammed Ben Abdellah a joué un rôle essentiel dans la préservation du droit islamique au Maroc. Analysez comment son travail a influencé les structures judiciaires marocaines contemporaines. \n\n- **Éléments visuels suggérés** : Diagramme des systèmes juridiques au 19ème siècle.\n- **Interactions recommandées** : Clic pour découvrir des extraits de textes juridiques de l'époque.\n\n---\n\n**Section 4 : Lalla Fatma N'Soumer (Fermé)**\n\n*Contenu détaillé (Ouvert) :*\n\nBien que berbère et d'origine algérienne, l'influence de Lalla Fatma N'Soumer s'est étendue au Maroc, notamment dans les mouvements de résistance berbères. Évaluez son impact sur la résistance marocaine et comment elle a inspiré les femmes dans les mouvements de libération.\n\n- **Éléments visuels suggérés** : Portraits et photographies des mouvements de résistance berbères.\n- **Interactions recommandées** : Survol pour découvrir des anecdotes inspirantes sur sa vie.\n\n---\n\n**Section 5 : Comparaison et Synthèse (Fermé)**\n\n*Contenu détaillé (Ouvert) :*\n\nDans cette section, vous allez comparer les contributions de ces personnages et leur impact sur le Maroc. Utilisez une grille d'analyse pour évaluer leurs rôles respectifs et leur influence sur l'histoire marocaine.\n\n- **Éléments visuels suggérés** : Grille d'analyse comparative.\n- **Interactions recommandées** : Clic pour compléter une activité de classement des personnages selon leur influence.\n\n---\n\nEn suivant cette progression logique, vous serez capable de comprendre et d'analyser les rôles des personnages historiques marocains du 19ème siècle, en situant chacun dans son contexte et en évaluant leur influence respective."
    },
    "06-Seq-01_accordion": {
      "activite": {
        "sequence": "Comparaison des dynasties marocaines",
        "num_ecran": "06-Seq-01",
        "titre_ecran": "Comparaison des dynasties",
        "sous_titre": "Caractéristiques des dynasties",
        "resume_contenu": "L'apprenant comparera les caractéristiques de deux dynasties marocaines, en identifiant différences et similitudes.",
        "type_activite": "accordion",
        "niveau_bloom": "Évaluer",
        "difficulte": "difficile",
        "duree_estimee": 25,
        "objectif_lie": "L'apprenant sera capable de comparer les différentes dynasties marocaines présentes au 19ème siècle.",
        "commentaire": "Encourager l'évaluation critique des dynasties à travers des critères spécifiques."
      },
      "script": "### Script d'Accordion : Comparaison des Dynasties\n\n**Introduction Générale du Contenu :**\n\nBienvenue dans cette activité où vous serez amené à comparer deux dynasties marocaines du 19ème siècle. En utilisant des critères spécifiques, vous évaluerez leurs caractéristiques, leurs contributions et leurs différences significatives. Préparez-vous à développer votre pensée critique et votre capacité d'analyse.\n\n---\n\n**Section 1 : Aperçu des Dynasties (Cliquez pour explorer)**\n\nContenu détaillé :\n\n- **Dynastie Alaouite** : Présente depuis le 17ème siècle, cette dynastie est connue pour son rôle dans la modernisation et la centralisation du pouvoir au Maroc. \n- **Dynastie Saadienne** : Ayant précédé les Alaouites, elle a été marquée par son influence sur le commerce transsaharien et ses efforts pour défendre le territoire contre les envahisseurs étrangers.\n\n*Éléments visuels suggérés :* \n- Carte chronologique des dynasties marocaines\n- Portraits des figures emblématiques de chaque dynastie\n\n*Interactions recommandées :* \n- Clic pour développer des définitions supplémentaires\n- Survol pour afficher des anecdotes historiques\n\n---\n\n**Section 2 : Structures Politiques (Déplier pour plus d'informations)**\n\nContenu détaillé :\n\n- **Organisation du pouvoir** : Comparer la centralisation sous les Alaouites avec les structures plus décentralisées des Saadiens.\n- **Influence extérieure** : Étudier comment chaque dynastie a interagi avec les puissances européennes émergentes.\n\n*Éléments visuels suggérés :* \n- Schéma de l'organisation politique sous chaque dynastie\n- Cartes illustrant les zones d'influence\n\n*Interactions recommandées :* \n- Clic pour des explications détaillées sur les structures politiques\n- Survol pour visualiser des citations de documents historiques\n\n---\n\n**Section 3 : Contributions Culturelles (Cliquez pour en savoir plus)**\n\nContenu détaillé :\n\n- **Architecture et Arts** : Analyse des styles architecturaux et des innovations artistiques introduites par chaque dynastie.\n- **Patrimoine Intellectuel** : Exploration des avancées éducatives et scientifiques de chaque période.\n\n*Éléments visuels suggérés :* \n- Galerie d'images de monuments emblématiques\n- Extraits de manuscrits ou d'œuvres d'art\n\n*Interactions recommandées :* \n- Clic pour agrandir les images et lire des descriptions\n- Survol pour écouter des extraits sonores liés aux dynasties\n\n---\n\n**Section 4 : Economie et Commerce (Déplier pour découvrir)**\n\nContenu détaillé :\n\n- **Ressources économiques** : Comparaison des ressources naturelles exploitées par chaque dynastie.\n- **Routes commerciales** : Analyse des routes commerciales sous chaque règne et leur impact économique.\n\n*Éléments visuels suggérés :* \n- Cartes des routes commerciales\n- Graphiques des exportations et importations\n\n*Interactions recommandées :* \n- Clic pour afficher des données chiffrées\n- Survol pour voir des images d'objets commerciaux typiques\n\n---\n\n**Section 5 : Critères d'Évaluation (Cliquez pour évaluer)**\n\nContenu détaillé :\n\n- **Critères de Comparaison** : Introduction des critères d'analyse pour évaluer chaque dynastie, comme la stabilité politique, l'impact culturel et l'innovation économique.\n- **Grille d'Analyse** : Présentation d'une grille pour noter chaque dynastie selon les critères définis.\n\n*Éléments visuels suggérés :* \n- Tableau comparatif des critères\n- Exemples d'évaluations critiques\n\n*Interactions recommandées :* \n- Clic pour remplir votre propre grille d'analyse\n- Survol pour obtenir des conseils sur l'évaluation critique\n\n---\n\n**Conclusion :**\n\nAprès avoir exploré chaque section, vous devriez maintenant être en mesure de comparer de manière critique les dynasties Alaouite et Saadienne. Réfléchissez à la manière dont ces dynasties ont influencé le Maroc et utilisez votre grille d'analyse pour formuler votre évaluation finale.\n\n*Élément visuel suggéré :* \n- Résumé visuel des points clés de chaque dynastie\n\n*Interaction recommandée :* \n- Clic pour soumettre votre évaluation et voir des évaluations comparatives d'autres apprenants."
    }
  }
}